<script lang="ts">
	import { type ImportMembersForm } from '$lib/types';
	import Dropzone from '$lib/Dropzone.svelte';

	let form: ImportMembersForm = {};
	let errors: ImportMembersForm = {};
	let url: string = '/members/import';
	let method: 'POST' = 'POST';
</script>

<p class="mb-5">Ο Αριθμός Μητρώου πρέπει να είναι αριθμός.</p>

<p class="mb-5">
	Μπορείτε να ανεβάσετε το ίδιο αρχείο όσες φορές θέλετε.
	<br />
	Μια εγγραφή αναζητείται με βάση τον <abbr class="font-bold">Αριθμό Μητρώου</abbr>, και αν υπάρχει
	ήδη τότε ανανεώνεται. Αν δεν υπάρχει, δημιουρείται.
	<br />
	Το ίδιο ισχύει για τις εταιρείες. Μια εταιρεία αναζητείται με βάση το συνδυασμό των πεδίων
	<abbr class="font-bold">Όμιλος</abbr>-<abbr class="font-bold">Εταιρεία</abbr>. Αν δεν υπάρχει ήδη
	εταιρεία με αυτόν τον συνδυασμό, δημιουργείται.
</p>

<p class="mb-5">
	Υποχρεωτικά πεδία είναι: <abbr class="font-bold">Α/Μ</abbr>, <abbr class="font-bold">Όνομα</abbr>,
	<abbr class="font-bold">Επώνυμο</abbr>, <abbr class="font-bold">Ημ/νία εγγραφής</abbr>.
	<br />
	Αν κάποιο από αυτά δεν είναι συμπληρωμένο, η εγγραφή αγνοείται.
</p>

<p class="mb-5">Οι ημερομηνίες πρέπει να έχουν τη μορφή που φαίνεται στο παράδειγμα.</p>

<p class="mb-5">
	Κατά τη διαδικασία της εισαγωγής από όλες τις τιμές αφαιρούνται οι τόνοι και μετατρέπονται σε
	ΚΕΦΑΛΑΙΑ.
</p>

<p class="mb-5">
	Κατά τη διαδικασία της εισαγωγής οι διευθύνσεις ταυτίζονται με διακεκριμένες τιμές που βρίσκονται
	προεγκατεστημένες στο σύστημα. Αν ένας Δήμος δε μπορεί να βρεθεί, αγνοείται.
	<br />
	Αν μία Οδός δε μπορεί να βρεθεί στο συγκεκριμένο Δήμο, αγνοείται.
</p>

<p class="mb-5">
	Το πεδίο <abbr class="font-bold">Έχει πληρώσει μέχρι</abbr> χρησιμοποιείται για να δημιουργηθεί μία
	εγγραφή πληρωμής που να εμφανίζει το μέλος ως οικονομικά εντάξει μέχρι τότε.
</p>

<p class="mb-5">
	Παράδειγμα εγγραφής:
	<img src="/members_import_example.png" class="w-full" alt="hero" />
</p>

<Dropzone />
